## Data

In [2]:
import pandas as pd
import numpy as np

In [3]:
students = {
    'name': ['Finley', 'Andrew', 'Blake', "Denis"],
    'last_name': ['Brown', 'Bradley', 'Hughes', "James"],
    'age': [23, 21, 34,24],
    "student_number":[101, 403, 202,1]
    

}

In [4]:
student_df = pd.DataFrame(students)

## Apply

* Fonksiyonları DataFrame ve Series objelerine uygulamamızı sağlar

* Apply uygulandığı yapının alt elemanlarına etki eder. DataFrame'in alt elemanları Series olduğu için olara, Series'e apply uygulanınca da onların elemanlarına etki edecek

### Apply Benzeri Fonksiyon Yazmak

In [12]:
def square(x):
    return x * x

In [13]:
def f(x):
    return x + 40

In [14]:
def apply(l, f):
    for i in range(len(l)):
        l[i] = f(l[i])
    
    return l

In [15]:
l = [1,2,3,4]

In [16]:
apply(l, square)

[1, 4, 9, 16]

In [17]:
l

[1, 4, 9, 16]

In [18]:
l = [1,2,3,4]

In [19]:
apply(l, f)

[41, 42, 43, 44]

In [20]:
l = [1,2,3,4]

In [21]:
apply(l, lambda x:x**3)

[1, 8, 27, 64]

### Series'de Apply

In [22]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

In [23]:
student_df["name"]

0    Finley
1    Andrew
2     Blake
3     Denis
Name: name, dtype: object

In [24]:
student_df["name"].apply(len) # len("merhaba")

0    6
1    6
2    5
3    5
Name: name, dtype: int64

In [25]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

In [26]:
def update_number(n):
    return n + 1000

In [27]:
student_df["student_number"]

0    101
1    403
2    202
3      1
Name: student_number, dtype: int64

In [28]:
student_df["student_number"].apply(update_number)

0    1101
1    1403
2    1202
3    1001
Name: student_number, dtype: int64

In [29]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

In [30]:
# Lambda Function'da kullanabiliriz

student_df["student_number"].apply(lambda x: x + 1000)

0    1101
1    1403
2    1202
3    1001
Name: student_number, dtype: int64

In [31]:
# Fonksiyon uygulandığında tip sorunu varsa hata alabiliriz

In [32]:
student_df.at[2, "student_number"] = "2"

C:\Users\omers\AppData\Local\Temp\ipykernel_12076\293890352.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '2' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  student_df.at[2, "student_number"] = "2"

In [33]:
student_df

     name last_name  age student_number
0  Finley     Brown   23            101
1  Andrew   Bradley   21            403
2   Blake    Hughes   34              2
3   Denis     James   24              1

In [59]:
student_df["student_number"].apply(lambda x: x + 1000)

TypeError: can only concatenate str (not "int") to str

In [11]:
"2" + 1000

TypeError: can only concatenate str (not "int") to str

In [60]:
student_df["student_number"].apply(lambda x: int(x) + 1000)

0    1101
1    1403
2    1002
3    1001
Name: student_number, dtype: int64

### DataFrames Apply

In [39]:
students = {
    'name': ['Finley', 'Andrew', 'Blake', "Denis", "Walter"],
    'last_name': ['Brown', 'Bradley', 'Hughes', "James", "Honey"],
    'age': [23, 21, 34,24, 26],
    "student_number":[101, 403, 202,1, 405]
    

}

In [40]:
student_df = pd.DataFrame(students)

In [41]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1
4  Walter     Honey   26             405

In [44]:
len(student_df["name"])

5

In [6]:
student_df["name"].apply(len)

0    6
1    6
2    5
3    5
Name: name, dtype: int64

In [12]:
# sütunda kaç tane eleman olduğunu verdi
# len metodu DataFrame'i oluşturan Series'lere uygulandı
student_df.apply(len)

name              5
last_name         5
age               5
student_number    5
dtype: int64

In [13]:
student_df.apply(len, axis = "columns")

0    4
1    4
2    4
3    4
4    4
dtype: int64

In [35]:
student_df

     name last_name  age student_number
0  Finley     Brown   23            101
1  Andrew   Bradley   21            403
2   Blake    Hughes   34              2
3   Denis     James   24              1

In [36]:
def weird(x):
    return x[0]

In [37]:
student_df.apply(weird)

name              Finley
last_name          Brown
age                   23
student_number       101
dtype: object

In [38]:
# Bununla aynı
student_df.iloc[0]

name              Finley
last_name          Brown
age                   23
student_number       101
Name: 0, dtype: object

In [39]:
student_df.apply(weird, axis="columns")

C:\Users\omers\AppData\Local\Temp\ipykernel_12076\314356834.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  return x[0]

0    Finley
1    Andrew
2     Blake
3     Denis
dtype: object

In [40]:
student_df.apply(weird, axis=1)

C:\Users\omers\AppData\Local\Temp\ipykernel_12076\314356834.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  return x[0]

0    Finley
1    Andrew
2     Blake
3     Denis
dtype: object

#### min

In [70]:
student_df.loc[:, ["age", "student_number"]].apply(pd.Series.min)

age               21
student_number     1
dtype: int64